#include <stdio.h>
#include <locale.h>
#include <string.h>

int main()
{
    setlocale(LC_ALL, "Russian");
    int a, b;
    char* mas1[13];
    char* mas2[32];


    mas1[1] = "января";
    mas1[2] = "февраля";
    mas1[3] = "марта";
    mas1[4] = "апреля";
    mas1[5] = "мая";
    mas1[6] = "июня";
    mas1[7] = "июля";
    mas1[8] = "августа";
    mas1[9] = "сентября";
    mas1[10] = "октября";
    mas1[11] = "ноября";
    mas1[12] = "декабря";

    mas2[1] = "первое";
    mas2[2] = "второе";
    mas2[3] = "третье";
    mas2[4] = "четвёртое";
    mas2[5] = "пятое";
    mas2[6] = "шестое";
    mas2[7] = "седьмое";
    mas2[8] = "восьмое";
    mas2[9] = "девятое";
    mas2[10] = "десятое";
    mas2[11] = "одиннадцатое";
    mas2[12] = "двенадцатое";
    mas2[13] = "тринадцатое"; 
    mas2[14] = "четырнадцатое";
    mas2[15] = "пятнадцатое";
    mas2[16] = "шестнадцатое";
    mas2[17] = "семнадцатое";
    mas2[18] = "восемнадцатое";
    mas2[19] = "девятнадцатое";
    mas2[20] = "двадцатое";
    mas2[21] = "двадцать первое";
    mas2[22] = "двадцать второе";
    mas2[23] = "двадцать третье";
    mas2[24] = "двадцать четвертое";
    mas2[25] = "двадцать пятое";
    mas2[26] = "двадцать шестое";
    mas2[27] = "двадцать седьмое";
    mas2[28] = "двадцать восьмое";
    mas2[29] = "двадцать девятое";
    mas2[30] = "тридцатое";
    mas2[31] = "тридцать первое";

    printf("1<=b<=31 Введите b: ");
    scanf_s("%d", &b);
    printf("1<=a<=12 Введите а: ");
    scanf_s("%d", &a);
   
    printf("%s %s", mas2[b], mas1[a]);

    return 0;
}